const yup = require("yup");

const contactValidator = yup.object().shape({
    name: yup
        .string('نام و نام خواندگی نام متعبر است')
        .required("نام و نام خانوادگی الزامی می‌باشد")
        .min(5, "نام و نام خانوادگی نباید کمتر از 5 کاراکتر باشد")
        .max(20, "نام و نام خانوادگی نباید بیشتر از 20 کاراکتر باشد"),
    email: yup
        .string("ایمیل نا متعبر است")
        .email("ایمیل نامعتبر است")
        .max(40,"ایمیل حداکثر میتواند 40 کارکتر باشد")
        .matches(
            /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|.(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/,"ایمیل نامتعبر است"
        )
        .required("ایمیل الزامی است"),
    phone: yup
        .string("شماره همراه نا متعبر است")
        .matches(/^[\+]?[(]?[0-9]{3}[)]?[-\s\.]?[0-9]{3}[-\s\.]?[0-9]{4,6}$/, "شماره همراه نامتعبر است")
        .required("شماره همراه الزامی است"),
    message: yup
        .string("پیام نامتعبر است")
        .max(45, "پیام حداکثر میتواند 45 کارکتر باشد")
        .min(8, "پیام باید حداقل ۸ کاراکتر باشد")
        .required("پیام الزامی می‌باشد"),

});




module.exports = {
    contactValidator,
};
