const yup = require("yup");




const orderValidator = yup.object().shape({
    name: yup
        .string('نام و نام خواندگی نام متعبر است')
        .required("نام و نام خانوادگی الزامی می‌باشد")
        .min(5, "نام و نام خانوادگی نباید کمتر از 5 کاراکتر باشد")
        .max(20, "نام و نام خانوادگی نباید بیشتر از 20 کاراکتر باشد"),
    email: yup
        .string("ایمیل نا متعبر است")
        .email("ایمیل نامعتبر است")
        .max(40, "ایمیل حداکثر میتواند 40 کارکتر باشد")
        .matches(
            /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|.(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/, "ایمیل نامتعبر است"
        )
        .required("ایمیل الزامی است"),
    phone: yup
        .string("شماره همراه نا متعبر است")
        .matches(/^[\+]?[(]?[0-9]{3}[)]?[-\s\.]?[0-9]{3}[-\s\.]?[0-9]{4,6}$/, "شماره همراه نامتعبر است")
        .required("شماره همراه الزامی است"),
    province: yup
        .string("نام استان معتبر نیست")
        .required("نام استان الزامی است")
        .max(20, "نام استان نباید بیشتر از 20 کاراکتر باشد"),
    city: yup
        .string("نام شهر معتبر نیست")
        .required("نام شهر الزامی است")
        .max(20, "نام شهر نباید بیشتر از 20 کاراکتر باشد"),
    address: yup
        .string("آدرس معتبر نیست")
        .required("آدرس الزامی است")
        .max(50, "آدرس نباید بیشتر از 50 کاراکتر باشد"),
    postalCode: yup
        .string("کد پستی معتبر نیست")
        .max(10, "کد پستی نباید بیشتر از 10 کاراکتر باشد")
        .required("کد پستی الزامی است"),
    message: yup
        .string("پیام شما معتبر نیست")
        .max(10, "پیام شما نباید بیشتر از 50 کاراکتر باشد")

});



module.exports = {
    orderValidator,
};
